# Pandas Serisi Oluşturmak

In [1]:
import pandas as pd

In [10]:
pd.Series([40,41,42,43,44])

0    40
1    41
2    42
3    43
4    44
dtype: int64

In [11]:
seri = pd.Series([40,41,42,43,44])

In [12]:
type(seri)

pandas.core.series.Series

In [13]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [14]:
seri.dtype

dtype('int64')

In [15]:
seri.size

5

In [16]:
seri.ndim

1

In [18]:
seri.values

array([40, 41, 42, 43, 44], dtype=int64)

In [22]:
seri.head(2)

0    40
1    41
dtype: int64

In [23]:
seri.tail(3)

2    42
3    43
4    44
dtype: int64

In [24]:
#index isimlendirmesi

In [26]:
pd.Series([40,41,42,43,44])

0    40
1    41
2    42
3    43
4    44
dtype: int64

In [27]:
pd.Series([40,41,42,43,44], index = [2,4,6,8,10])

2     40
4     41
6     42
8     43
10    44
dtype: int64

In [28]:
pd.Series([40,41,42,43,44], index = ["a","b","c","d","e"])

a    40
b    41
c    42
d    43
e    44
dtype: int64

In [29]:
seri = pd.Series([40,41,42,43,44], index = ["a","b","c","d","e"])

In [30]:
seri["a"]

40

In [31]:
seri["a":"c"]

a    40
b    41
c    42
dtype: int64

In [32]:
#sozluk üzerinden liste olusturmak

In [35]:
sozluk = {"reg":10, "log":11, "cart": 12}

In [36]:
seri = pd.Series(sozluk)

In [37]:
seri

reg     10
log     11
cart    12
dtype: int64

In [38]:
#iki seriyi birlestirerek seri olusturma

In [40]:
pd.concat([seri, seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

# Eleman İşlemleri

In [42]:
import numpy as np
a  = np.array([21,32,43,54,65])
seri = pd.Series(a)
seri

0    21
1    32
2    43
3    54
4    65
dtype: int32

In [43]:
seri[2]

43

In [44]:
seri[1:4]

1    32
2    43
3    54
dtype: int32

In [70]:
seri = pd.Series([141,61,440,216,532], 
                 index = ["str", "dex","int","vit", "dps"])

In [71]:
seri

str    141
dex     61
int    440
vit    216
dps    532
dtype: int64

In [72]:
seri.index

Index(['str', 'dex', 'int', 'vit', 'dps'], dtype='object')

In [73]:
seri.keys

<bound method Series.keys of str    141
dex     61
int    440
vit    216
dps    532
dtype: int64>

In [74]:
list(seri.items())

[('str', 141), ('dex', 61), ('int', 440), ('vit', 216), ('dps', 532)]

In [75]:
seri.values

array([141,  61, 440, 216, 532], dtype=int64)

In [76]:
#eleman sorgulama

In [77]:
"str" in seri

True

In [78]:
"rogue" in seri

False

In [79]:
seri["str"]

141

In [65]:
#fancy eleman sorgulama

In [80]:
seri[["str", "int"]]

str    141
int    440
dtype: int64

In [81]:
seri["str"] = 167

In [83]:
seri["str"]

167

In [84]:
seri["str":"vit"]

str    167
dex     61
int    440
vit    216
dtype: int64

# Pandas DataFrame Oluşturma

In [85]:
import pandas as pd

In [86]:
l = [34,35,36,37]

In [87]:
l

[34, 35, 36, 37]

In [88]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0             34
1             35
2             36
3             37

In [90]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [92]:
pd.DataFrame(m, columns = ["v1", "v2", "v3"])

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [93]:
#df isimlendirme

In [94]:
df = pd.DataFrame(m, columns = ["v1", "v2", "v3"])

In [95]:
df.head()

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [99]:
df.columns = ("a1", "a2", "a3")

In [100]:
df

   a1  a2  a3
0   1   2   3
1   4   5   6
2   7   8   9

In [101]:
type(df)

pandas.core.frame.DataFrame

In [102]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['a1', 'a2', 'a3'], dtype='object')]

In [104]:
df.shape

(3, 3)

In [105]:
df.ndim

2

In [106]:
df.size

9

In [107]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [108]:
type(df.values)

numpy.ndarray

In [112]:
df.head(1)

   a1  a2  a3
0   1   2   3

In [111]:
df.tail(2)

   a1  a2  a3
1   4   5   6
2   7   8   9

In [113]:
a = np.array([1,2,3,4,5])

In [115]:
pd.DataFrame(a, columns = ["degerler"])

   degerler
0         1
1         2
2         3
3         4
4         5

# Eleman İşlemleri

In [116]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [117]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}

In [118]:
sozluk

{'var1': array([4, 9, 1, 1, 7]),
 'var2': array([6, 6, 6, 8, 1]),
 'var3': array([9, 4, 4, 7, 9])}

In [119]:
df = pd.DataFrame(sozluk)

In [120]:
df

   var1  var2  var3
0     4     6     9
1     9     6     4
2     1     6     4
3     1     8     7
4     7     1     9

In [121]:
df[1:3]

   var1  var2  var3
1     9     6     4
2     1     6     4

In [122]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [123]:
df.index = ["a","b","c","d","e"]

In [124]:
df

   var1  var2  var3
a     4     6     9
b     9     6     4
c     1     6     4
d     1     8     7
e     7     1     9

In [128]:
df["b":"d"]

   var1  var2  var3
b     9     6     4
c     1     6     4
d     1     8     7

In [129]:
#silme

In [130]:
df.drop("a", axis = 0)

   var1  var2  var3
b     9     6     4
c     1     6     4
d     1     8     7
e     7     1     9

In [132]:
df

   var1  var2  var3
a     4     6     9
b     9     6     4
c     1     6     4
d     1     8     7
e     7     1     9

In [133]:
df.drop("a", axis = 0, inplace = True) #kalıcı silme, inplace True

In [134]:
df

   var1  var2  var3
b     9     6     4
c     1     6     4
d     1     8     7
e     7     1     9

In [135]:
#fancy

In [136]:
l = ["c", "d"]

In [137]:
df.drop(l, axis = 0)

   var1  var2  var3
b     9     6     4
e     7     1     9

In [138]:
#degiskenler icin

In [140]:
"var1" in df

True

In [141]:
l = ["var1", "var5", "var2"]

In [142]:
for i in l:
    print(i in df)

True
False
True

In [143]:
df

   var1  var2  var3
b     9     6     4
c     1     6     4
d     1     8     7
e     7     1     9

In [144]:
df["var4"] = df["var1"] * df["var2"]

In [145]:
df

   var1  var2  var3  var4
b     9     6     4    54
c     1     6     4     6
d     1     8     7     8
e     7     1     9     7

In [146]:
#degisken silmek

In [147]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     9     6     4
c     1     6     4
d     1     8     7
e     7     1     9

In [148]:
df

   var1  var2  var3  var4
b     9     6     4    54
c     1     6     4     6
d     1     8     7     8
e     7     1     9     7

In [149]:
df.drop("var4", axis = 1, inplace = True)

In [150]:
df

   var1  var2  var3
b     9     6     4
c     1     6     4
d     1     8     7
e     7     1     9

In [151]:
l = ["var1", "var2"]

In [152]:
df.drop(l, axis = 1)

   var3
b     4
c     4
d     7
e     9

# Gözlem ve Değişken Seçimi loc & iloc

In [154]:
import numpy as np
import pandas as pd
m = np.random.randint(1,99, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    71    14    68
1    14    16    95
2    20    90    40
3    34    87    92
4    25    62    27
5    41    47    68
6    45    83    82
7    45     6    52
8    97    77    56
9    72    83    85

In [157]:
#loc: secilen indeks degerlerinin tamamina ulasir.

In [161]:
df.loc[1:3]

   var1  var2  var3
1    14    16    95
2    20    90    40
3    34    87    92

In [164]:
#iloc secilen indeks degerlerine 'e' kadar ulasir.

In [165]:
df.iloc[1:3]

   var1  var2  var3
1    14    16    95
2    20    90    40

In [167]:
df.iloc[1,0]

14

In [169]:
df.iloc[:3,:2]

   var1  var2
0    71    14
1    14    16
2    20    90

In [170]:
df.loc[1:3,"var3"]

1    95
2    40
3    92
Name: var3, dtype: int32

In [174]:
df.iloc[1:3] ["var3"]

1    95
2    40
Name: var3, dtype: int32

# Koşullu Eleman İşlemleri

In [182]:
import numpy as np
import pandas as pd
m = np.random.randint(1,88, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    49    32     1
1    66    66    81
2     8    83    77
3    69    41    84
4    53    41    62
5     4    51    83
6     9    12     7
7    66    33    13
8    84    47    71
9    20    41    47

In [183]:
df["var1"]

0    49
1    66
2     8
3    69
4    53
5     4
6     9
7    66
8    84
9    20
Name: var1, dtype: int32

In [184]:
df["var1"][0:2]

0    49
1    66
Name: var1, dtype: int32

In [185]:
df[0:2]

   var1  var2  var3
0    49    32     1
1    66    66    81

In [179]:
df [0:2] [["var1", "var2"]]

   var1  var2
0    50    84
1    72    47

In [186]:
df

   var1  var2  var3
0    49    32     1
1    66    66    81
2     8    83    77
3    69    41    84
4    53    41    62
5     4    51    83
6     9    12     7
7    66    33    13
8    84    47    71
9    20    41    47

In [190]:
df[df.var1 > 40]

   var1  var2  var3
0    49    32     1
1    66    66    81
3    69    41    84
4    53    41    62
7    66    33    13
8    84    47    71

In [192]:
df[(df.var1 > 40) & (df.var3 < 20)]

   var1  var2  var3
0    49    32     1
7    66    33    13

In [195]:
df.loc[(df.var1 > 40), ["var1", "var2"]]

   var1  var2
0    49    32
1    66    66
3    69    41
4    53    41
7    66    33
8    84    47

In [196]:
df[(df.var1 > 40)] [["var1", "var2"]]

   var1  var2
0    49    32
1    66    66
3    69    41
4    53    41
7    66    33
8    84    47

# Birleştirme (Join) İşlemleri

In [198]:
import numpy as np
import pandas as pd
m = np.random.randint(1, 77, size = (5,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    50    49    67
1    64    41    67
2     3    10    51
3    48     5    44
4    49    45    13

In [199]:
df2 = df + 20

In [200]:
df2

   var1  var2  var3
0    70    69    87
1    84    61    87
2    23    30    71
3    68    25    64
4    69    65    33

In [201]:
pd.concat([df,df2])

   var1  var2  var3
0    50    49    67
1    64    41    67
2     3    10    51
3    48     5    44
4    49    45    13
0    70    69    87
1    84    61    87
2    23    30    71
3    68    25    64
4    69    65    33

In [203]:
pd.concat([df,df2], ignore_index = True)

   var1  var2  var3
0    50    49    67
1    64    41    67
2     3    10    51
3    48     5    44
4    49    45    13
5    70    69    87
6    84    61    87
7    23    30    71
8    68    25    64
9    69    65    33

In [204]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [207]:
df2.columns = ["var1","var2","deg3"]

In [209]:
df2

   var1  var2  deg3
0    70    69    87
1    84    61    87
2    23    30    71
3    68    25    64
4    69    65    33

In [212]:
pd.concat([df, df2], join ="inner")

   var1  var2
0    50    49
1    64    41
2     3    10
3    48     5
4    49    45
0    70    69
1    84    61
2    23    30
3    68    25
4    69    65

# İleri Birleştirme İşlemleri

In [1]:
import pandas as pd

In [2]:
#birebir birleştirme

In [3]:
df1 = pd.DataFrame({"suruculer": ["Valteri", "Lando", "Max", "Charles"],
                   "markalar": ["Mercedes", "McLaren", "RedBull", "Ferrari"]})

df1

  suruculer  markalar
0   Valteri  Mercedes
1     Lando   McLaren
2       Max   RedBull
3   Charles   Ferrari

In [4]:
df2 = pd.DataFrame({"suruculer": ["Valteri", "Lando", "Max", "Charles"],
                   "podyum": [48, 1, 37, 11]})
df2

  suruculer  podyum
0   Valteri      48
1     Lando       1
2       Max      37
3   Charles      11

In [5]:
pd.merge(df1, df2)

  suruculer  markalar  podyum
0   Valteri  Mercedes      48
1     Lando   McLaren       1
2       Max   RedBull      37
3   Charles   Ferrari      11

In [6]:
pd.merge(df1, df2, on = "suruculer")

  suruculer  markalar  podyum
0   Valteri  Mercedes      48
1     Lando   McLaren       1
2       Max   RedBull      37
3   Charles   Ferrari      11

In [7]:
#many to one, coktan teke

In [8]:
df3 = pd.merge(df1, df2)

In [9]:
df3

  suruculer  markalar  podyum
0   Valteri  Mercedes      48
1     Lando   McLaren       1
2       Max   RedBull      37
3   Charles   Ferrari      11

In [11]:
df4 = pd.DataFrame({"markalar": ["Mercedes", "Ferrari", "RedBull"],
                   "patron": ["Toto Wolff", "Mattia Binotto", "Christian Horner"]})
df4

   markalar            patron
0  Mercedes        Toto Wolff
1   Ferrari    Mattia Binotto
2   RedBull  Christian Horner

In [12]:
pd.merge(df3, df4)

  suruculer  markalar  podyum            patron
0   Valteri  Mercedes      48        Toto Wolff
1       Max   RedBull      37  Christian Horner
2   Charles   Ferrari      11    Mattia Binotto

In [13]:
#coktan coka

In [16]:
df5 = pd.DataFrame({"markalar": ["Mercedes", "Mercedes", 
                                 "Ferrari", "Ferrari",
                                "RedBull", "RedBull"],
                   "sponsorlar": ["Petronas", "Ineos", 
                                  "Shell", "kaspersky",
                               "Aston Martin", "Honda"]})
df5

   markalar    sponsorlar
0  Mercedes      Petronas
1  Mercedes         Ineos
2   Ferrari         Shell
3   Ferrari     kaspersky
4   RedBull  Aston Martin
5   RedBull         Honda

In [17]:
df1

  suruculer  markalar
0   Valteri  Mercedes
1     Lando   McLaren
2       Max   RedBull
3   Charles   Ferrari

In [19]:
pd.merge(df1, df5)

  suruculer  markalar    sponsorlar
0   Valteri  Mercedes      Petronas
1   Valteri  Mercedes         Ineos
2       Max   RedBull  Aston Martin
3       Max   RedBull         Honda
4   Charles   Ferrari         Shell
5   Charles   Ferrari     kaspersky

# Toplulaştırma ve Gruplandırma (Aggregation & Grouping)

Basit toplulaştırma fonksiyonları:
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [20]:
import seaborn as sns

In [30]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [32]:
df.shape

(1035, 6)

In [35]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [36]:
df["mass"].mean()

2.6381605847953233

In [37]:
df["mass"].count()

513

In [38]:
df["mass"].min()

0.0036

In [39]:
df["mass"].max()

25.0

In [40]:
df["mass"].sum()

1353.37638

In [41]:
df["mass"].std()

3.8186166509616046

In [42]:
df["mass"].var()

14.58183312700122

In [45]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [46]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [47]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemleri

In [49]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'], 
                  'veri': [10, 11, 52, 54, 65, 75]}, columns = ['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    54
4       B    65
5       C    75

In [50]:
df.groupby("gruplar")

In [51]:
df.groupby("gruplar").mean()

         veri
gruplar
A        32.0
B        38.0
C        63.5

In [52]:
df.groupby("gruplar").sum()

         veri
gruplar
A          64
B          76
C         127

In [53]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [54]:
df.groupby("method")

In [55]:
df.groupby("method") ["orbital_period"]

In [60]:
df.groupby("method") ["orbital_period"].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [64]:
df.groupby("method") ["distance"].sum()

method
Astrometry                           35.75
Eclipse Timing Variations          1261.44
Imaging                            2166.91
Microlensing                      41440.00
Orbital Brightness Modulation      2360.00
Pulsar Timing                      1200.00
Pulsation Timing Variations           0.00
Radial Velocity                   27348.11
Transit                          134242.77
Transit Timing Variations          3313.00
Name: distance, dtype: float64

# İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)

In [73]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'degisken1': [10,32,45,65,76,88],
                  'degisken2': [100,523,765,463,257,769]},
                 columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         32        523
2       C         45        765
3       A         65        463
4       B         76        257
5       C         88        769

In [74]:
#aggregate

In [75]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             37.5      281.5
B             54.0      390.0
C             66.5      767.0

In [81]:
df.groupby("gruplar").aggregate([min, np.median, max]) #verileri grup setine göre böl, kendi liste formumda beklediğim fonksiyonları aldım.

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   37.5  65       100  281.5  463
B              32   54.0  76       257  390.0  523
C              45   66.5  88       765  767.0  769

In [84]:
#filter

In [85]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'degisken1': [10,32,43,54,56,87],
                  'degisken2': [312,543,675,876,345,789]},
                 columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        312
1       B         32        543
2       C         43        675
3       A         54        876
4       B         56        345
5       C         87        789

In [92]:
def filter_func(x):
    return x["degisken1"].std() > 20

In [93]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
0       A         10        312
2       C         43        675
3       A         54        876
5       C         87        789

In [94]:
#transform

In [99]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                  "degisken1": [12,43,65,67,23,11],
                  "degisken2": [321,345,765,234,897,234]},
                 columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         12        321
1       B         43        345
2       C         65        765
3       A         67        234
4       B         23        897
5       C         11        234

In [100]:
df["degisken1"]*7

0     84
1    301
2    455
3    469
4    161
5     77
Name: degisken1, dtype: int64

In [106]:
df_a = df.iloc[:,1:3]

In [108]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.979052  -0.501208
1   0.243120  -0.418249
2   1.110468   1.033525
3   1.189318  -0.801932
4  -0.545378   1.489797
5  -1.018477  -0.801932

In [109]:
#apply

In [123]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                  "degisken1": [12,43,65,67,23,11],
                  "degisken2": [233,345,765,234,890,234]},
                 columns = ["gruplar","degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         12        233
1       B         43        345
2       C         65        765
3       A         67        234
4       B         23        890
5       C         11        234

In [121]:
df.apply(np.sum)

degisken1     221
degisken2    2701
dtype: int64

In [122]:
df.apply(np.mean)

degisken1     36.833333
degisken2    450.166667
dtype: float64

In [126]:
df.groupby("gruplar").apply(np.mean)

         degisken1  degisken2
gruplar
A             39.5      233.5
B             33.0      617.5
C             38.0      499.5

# Pivot Tablolar

In [2]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [5]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [6]:
#pivot ile table

In [7]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [9]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [10]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [11]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# Dış Kaynaklı Veri Okumak

In [12]:
import pandas as pd